[
  {
    "title": "Celebrating 50k Subscribers and Calling for Mod Applications! Join Us as a Mod in our Growing Community!",
    "description": "none",
    "votes": "none"
  },
  {
    "title": "Late Night Random Discussion Thread - September 08, 2023",
    "description": "none",
    "votes": "none"
  },
  {
    "title": "Why do many people hate 'feminism'?",
    "description": [
      "Lately, I've noticed a bunch of folks throwing shade at feminists, especially women. It's kinda bugging me because feminism is basically all about equal rights for everyone. Some of my friends are like, \"Why not just call it equality if it's about everyone being treated the same?\" Others have brought up this \"meninism\" thing.There are many words where \"man\" or \"men\" is used (like 'man-made,' 'mankind,' etc). Bro, let's leave feminism for us.",
      "Cuz, hey, feminism started because women were getting a raw deal, and guys were usually the privileged ones. So, why even suggest \"meninism\" when dudes are already pretty privileged? Let's leave some space for women and other genders, right?",
      "Regardless, I know there are some pseudo- feminists as well and the concept of feminism has evolved over time, as all ideologies do. Ideas change with time and space.",
      "First-wave feminism focused on issues like women's suffrage and legal rights. Second-wave feminism, for instance, addressed reproductive rights, workplace discrimination, and sexual liberation. We are still working towards these goals, and some people perceive it as unfair to men in certain ways (HOWWW? ) Subsequent waves have continued to expand the scope of feminist activism to include issues like intersectionality, LGBTQ+ rights, and global gender equality. I know that feminism is not a monolithic ideology, and there are various perspectives and approaches within the feminist movement.Feminism often challenges traditional gender roles and norms, As Simone de Beauvoir said, a0one is not born a woman, but becomes one that means women and men are conditioned into gender roles by cultural conventions and we have to start somewhere in order to have autonomy over self.",
      "That being said, I am not here to defend any particular school of feminism because everyone is entitled to their opinions and the right to uphold their ideologies. It just bums me out when I see people hating on feminism, especially when it's coming from women. And I am trying to understand the other side of it which I may have missed.",
      "So, what's your take on why some people aren't feeling the love for feminists?"
    ],
    "votes": "none"
  },
  {
    "title": "Controversial question - are straight men/women attracted to trans women/men bisexual or straight?",
    "description": [
      "One of the biggest example is the sex tourism of Thailand, so many men - including many Indian men (married or in a relationship) seek the sexual services of lady boys in Thailand. Many of these ladyboys haven't had bottom surgery. Would you consider sexual act with them as a straight intercourse or a bisexual intercourse? In the case its latter, is being a bisexual far more common than we are forced to accept? If you think its the former, would you say that genitalia doesn't define sexuality or being a man or a woman at all?",
      "I do not mean any offence to the LGBTQ+ community, this is a genuine question from my side and I want to hear everyone's opinions on it because I find my opinion on this lacking/ not very nuanced.",
      "Let me know if this requires an NSFW tag"
    ],
    "votes": "none"
  },
  {
    "title": "Am I asking for too much in the relationship?",
    "description": [
      "I'v been with this guy for 4 months (we met online) and are considered taking things forward. We are in the same city but don't get to meet much. He's in college awaiting his placements, while Iive with my fam and work.",
      "Anyways we had a big fight yesterday. For a while, I'd been feeling a little unloved. I don't know if my reasons are valid or not.",
      "You see, he has a different way of showing love.. he makes it a point that he keeps in touch throughout the whole day, sends pictures/videos, takes time out from his super busy schedule just so we can videocall after I'm done with work. I really appreciate it all. I really, really do.",
      "But the only time I feel loved",
      "romantically",
      "is when we meet. He makes me feel really good, although it's usually because it's physical. His words just come out softer, and he's a lot more affectionate.",
      "But daily on chat (and even on videocalls)? You'd say we talk like friends. And that's what my issue is. No hearts, no kisses, no nicknames. This is, for some reason, important for me to feel loved romantically.",
      "All reels are on food and places to visit or funny stuff. Not one drop of romance at all. He used to be super romantic on chat and craved for it too back when we had just started but all of that disappeared.. I figured it was because he was super super stressed... I didn't ask him for much, but I felt super rejected when he started ignoring all the hearts and kisses I sent him. I've conveyed this to him before but nothing came out of it.",
      "So back to yesterday, he asked me on text to call him back and I asked him to say that lovingly. He didn't. So I feigned anger (acting cute, cringe I know) just to get some love and soothing from him... but he just said go to sleep and cut the call. I was upset and sent him a text with a thumbs up and he blew up.",
      "He told me that I don't value all the efforts (mentioned above) he puts in and one fucking heart is above it all. We had a long and heated argument where we almost broke up. I felt that it was justified for me to ask him to be a little more romantic but now I don't know anymore.",
      "What is your opinion, ladies ?"
    ],
    "votes": "none"
  }
]
